-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 21, 2025 at 03:51 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.0.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `mediccall`
--

-- --------------------------------------------------------

--
-- Table structure for table `patient_logs`
--

CREATE TABLE `patient_logs` (
  `id` int(11) NOT NULL,
  `patient_queue_id` int(11) NOT NULL,
  `patient_name` varchar(255) NOT NULL,
  `action_description` text NOT NULL,
  `performed_by_id` varchar(100) NOT NULL,
  `performed_by_name` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `patient_logs`
--

INSERT INTO `patient_logs` (`id`, `patient_queue_id`, `patient_name`, `action_description`, `performed_by_id`, `performed_by_name`, `created_at`) VALUES
(1, 5, 'ปาริชาติ อังคณะวัฒนา', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-20 09:18:49'),
(2, 5, 'ปาริชาติ อังคณะวัฒนา', 'เคาน์เตอร์กำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '97', 'นายทดสอบระบบ', '2025-09-20 09:18:55'),
(3, 5, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพรับงานเข้าห้อง Room 5 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:21:54'),
(4, 5, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:22:19'),
(5, 5, 'ปาริชาติ อังคณะวัฒนา', 'แพทย์ส่งกลับไปทำกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:22:39'),
(6, 5, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:22:50'),
(7, 5, 'ปาริชาติ อังคณะวัฒนา', 'แพทย์ส่งกลับไปทำกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:23:11'),
(8, 5, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:23:26'),
(9, 5, 'ปาริชาติ อังคณะวัฒนา', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:24:00'),
(10, 5, 'ปาริชาติ อังคณะวัฒนา', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-20 09:28:56'),
(11, 9, 'วิกูล แสงอุทัยวัฒนา', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-20 09:29:01'),
(12, 9, 'วิกูล แสงอุทัยวัฒนา', 'เคาน์เตอร์กำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '97', 'นายทดสอบระบบ', '2025-09-20 09:29:09'),
(13, 9, 'วิกูล แสงอุทัยวัฒนา', 'นักกายภาพรับงานเข้าห้อง Room 3 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:29:46'),
(14, 9, 'วิกูล แสงอุทัยวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:29:57'),
(15, 9, 'วิกูล แสงอุทัยวัฒนา', 'แพทย์ส่งกลับไปทำกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:30:23'),
(16, 9, 'วิกูล แสงอุทัยวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:30:31'),
(17, 9, 'วิกูล แสงอุทัยวัฒนา', 'แพทย์ส่งกลับไปทำกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:30:53'),
(18, 9, 'วิกูล แสงอุทัยวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:31:15'),
(19, 9, 'วิกูล แสงอุทัยวัฒนา', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:31:29'),
(20, 11, 'ปาริชาติ อังคณะวัฒนา', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-20 09:36:35'),
(21, 11, 'ปาริชาติ อังคณะวัฒนา', 'เคาน์เตอร์กำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '97', 'นายทดสอบระบบ', '2025-09-20 09:36:41'),
(22, 11, 'ปาริชาติ อังคณะวัฒนา', 'แพทย์ส่งกลับไปรอทำกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:50:38'),
(23, 11, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพรับงานเข้าห้อง Room 2 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:51:12'),
(24, 11, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:51:17'),
(25, 11, 'ปาริชาติ อังคณะวัฒนา', 'แพทย์ส่งกลับไปรอทำกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:51:47'),
(26, 13, 'ฐิติยา เกียรติระบิล', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-20 09:55:44'),
(27, 13, 'ฐิติยา เกียรติระบิล', 'เคาน์เตอร์กำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '97', 'นายทดสอบระบบ', '2025-09-20 09:55:49'),
(28, 13, 'ฐิติยา เกียรติระบิล', 'แพทย์ส่งกลับไปรอทำกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:56:14'),
(29, 11, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพรับงานเข้าห้อง Room 4 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:56:24'),
(30, 11, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:56:37'),
(31, 13, 'ฐิติยา เกียรติระบิล', 'นักกายภาพรับงานเข้าห้อง Room 3 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:57:00'),
(32, 13, 'ฐิติยา เกียรติระบิล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 09:57:10'),
(33, 11, 'ปาริชาติ อังคณะวัฒนา', 'แพทย์ส่งกลับไปรอทำกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:57:23'),
(34, 13, 'ฐิติยา เกียรติระบิล', 'แพทย์ส่งกลับไปรอทำกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 09:57:42'),
(35, 11, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพรับงานเข้าห้อง Room 1A และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 10:10:06'),
(36, 11, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 10:10:24'),
(37, 11, 'ปาริชาติ อังคณะวัฒนา', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 10:10:52'),
(38, 11, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 10:13:50'),
(39, 11, 'ปาริชาติ อังคณะวัฒนา', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 10:14:09'),
(40, 11, 'ปาริชาติ อังคณะวัฒนา', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 10:14:30'),
(41, 13, 'ฐิติยา เกียรติระบิล', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 13:25:41'),
(42, 11, 'ปาริชาติ อังคณะวัฒนา', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 13:25:44'),
(43, 13, 'ฐิติยา เกียรติระบิล', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 13:25:49'),
(44, 13, 'ฐิติยา เกียรติระบิล', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 13:26:01'),
(45, 13, 'ฐิติยา เกียรติระบิล', 'แพทย์ส่งกลับไปรอทำกายภาพ (คิวกลาง)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-20 13:26:07'),
(46, 13, 'ฐิติยา เกียรติระบิล', 'นักกายภาพรับงานเข้าห้อง Room 1A และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 13:26:48'),
(47, 13, 'ฐิติยา เกียรติระบิล', 'นักกายภาพจบงาน (ส่งชำระเงิน)', '99', 'ทดสอบ นักกายภาพ', '2025-09-20 13:26:58'),
(48, 3344, 'สุขุม เตชัสวงศ์', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-21 02:48:17'),
(49, 3344, 'สุขุม เตชัสวงศ์', 'นักกายภาพรับงานเข้าห้อง Room 3 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 02:49:05'),
(50, 3344, 'สุขุม เตชัสวงศ์', 'เคลียร์คิวอัตโนมัติ (ไม่พบใน JERA)', 'system', 'System', '2025-09-21 02:49:44'),
(51, 3346, '', 'นักกายภาพรับงานเข้าห้อง Room 2 และกำหนดแพทย์: หมอโบว์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 02:49:44'),
(52, 3855, '', 'นักกายภาพรับงานเข้าห้อง Room 3 และกำหนดแพทย์: หมอโบว์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 02:50:35'),
(53, 4098, '', 'นักกายภาพรับงานเข้าห้อง Room 2 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 02:51:34'),
(54, 4277, 'ปออ ล้อมเสถียร', 'นักกายภาพรับงานเข้าห้อง Room 1A และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 02:52:00'),
(55, 4280, 'นทีทอง ทองไทย', 'นักกายภาพรับงานเข้าห้อง Room 4 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 02:52:13'),
(56, 4279, 'ศิริญญา ฉิมดิษฐ', 'นักกายภาพรับงานเข้าห้อง Room 2 และกำหนดแพทย์: หมอโบว์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 02:52:24'),
(57, 4277, 'ปออ ล้อมเสถียร', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 02:52:45'),
(58, 4280, 'นทีทอง ทองไทย', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 02:53:08'),
(59, 4277, 'ปออ ล้อมเสถียร', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 02:53:25'),
(60, 4280, 'นทีทอง ทองไทย', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 03:14:41'),
(61, 4277, 'ปออ ล้อมเสถียร', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 03:14:44'),
(62, 4279, 'ศิริญญา ฉิมดิษฐ', 'เคลียร์คิวอัตโนมัติ (ไม่พบใน JERA)', 'system', 'System', '2025-09-21 03:24:51'),
(63, 4278, '', 'นักกายภาพรับงานเข้าห้อง Room 1A และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:36:10'),
(64, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:18'),
(65, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:21'),
(66, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:23'),
(67, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:24'),
(68, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:24'),
(69, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:24'),
(70, 4278, '', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:25'),
(71, 4278, '', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:26'),
(72, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:27'),
(73, 4278, '', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:28'),
(74, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:35'),
(75, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:35'),
(76, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:35'),
(77, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:36'),
(78, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:36'),
(79, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:36:36'),
(80, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพรับงานเข้าห้อง Room 1A และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:36:42'),
(81, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 03:37:20'),
(82, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:36'),
(83, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:37'),
(84, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:38'),
(85, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:38'),
(86, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:39'),
(87, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:39'),
(88, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:39'),
(89, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:39'),
(90, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:40'),
(91, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:40'),
(92, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:40'),
(93, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:40'),
(94, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:40'),
(95, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:41'),
(96, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:41'),
(97, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:42'),
(98, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:42'),
(99, 4277, 'ปออ ล้อมเสถียร', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:42'),
(100, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:43'),
(101, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:43'),
(102, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:43'),
(103, 4280, 'นทีทอง ทองไทย', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:37:43'),
(104, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:48'),
(105, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:50'),
(106, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:50'),
(107, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:50'),
(108, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:50'),
(109, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:50'),
(110, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:54'),
(111, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:55'),
(112, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:55'),
(113, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:58'),
(114, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:58'),
(115, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:59'),
(116, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:59'),
(117, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:59'),
(118, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:59'),
(119, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:37:59'),
(120, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:00'),
(121, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:00'),
(122, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:00'),
(123, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:00'),
(124, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:00'),
(125, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:01'),
(126, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:01'),
(127, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:01'),
(128, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:01'),
(129, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:06'),
(130, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:06'),
(131, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:07'),
(132, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:07'),
(133, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:07'),
(134, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:07'),
(135, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:38:07'),
(136, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 03:39:24'),
(137, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'นักกายภาพจบงาน (ส่งชำระเงิน)', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:39:40'),
(138, 4282, 'ฎาชาญ์ โกมลสิงห์สกุล', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 03:40:37'),
(139, 1, 'ปออ ล้อมเสถียร', 'นักกายภาพรับงานเข้าห้อง Room 3 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:43:36'),
(140, 1, 'ปออ ล้อมเสถียร', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:43:44'),
(141, 1, 'ปออ ล้อมเสถียร', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 03:44:05'),
(142, 1, 'ปออ ล้อมเสถียร', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 03:49:42'),
(143, 1, 'ปออ ล้อมเสถียร', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 04:07:17'),
(144, 1, 'ปออ ล้อมเสถียร', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 04:07:25'),
(145, 1, 'ปออ ล้อมเสถียร', 'เคลียร์คิวอัตโนมัติ (ไม่พบใน JERA)', 'system', 'System', '2025-09-21 04:25:56'),
(146, 432, 'นิธิพัฒน์ พุฒทอง', 'นักกายภาพรับงานเข้าห้อง Room 2 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 09:03:12'),
(147, 1, 'นิธิพัฒน์ พุฒทอง', 'เคาน์เตอร์ส่งต่อคนไข้', '97', 'นายทดสอบระบบ', '2025-09-21 09:57:43'),
(148, 1, 'นิธิพัฒน์ พุฒทอง', 'นักกายภาพรับงานเข้าห้อง Room 3 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 09:59:08'),
(149, 57, 'ปวีณา ปุลิเวคินทร์', 'นักกายภาพรับงานเข้าห้อง Room 5 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:02:58'),
(150, 1, 'นิธิพัฒน์ พุฒทอง', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:04:07'),
(151, 7, 'นิสา ชาญประเสริฐ', 'นักกายภาพรับงานเข้าห้อง Room 2 และกำหนดแพทย์: หมอโบว์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:05:09'),
(152, 5, 'อลิสา ธีปริญญะกุล', 'นักกายภาพรับงานเข้าห้อง Room 1A และกำหนดแพทย์: พญ.กัลยกร บุษปวนิช', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:05:31'),
(153, 103, 'จตุภัทร์ ตั้งคารวคุณ', 'นักกายภาพรับงานเข้าห้อง Room 1B และกำหนดแพทย์: พญ.กัลยกร บุษปวนิช', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:05:38'),
(154, 1, 'นิธิพัฒน์ พุฒทอง', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:06:08'),
(155, 57, 'ปวีณา ปุลิเวคินทร์', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:09:58'),
(156, 5, 'อลิสา ธีปริญญะกุล', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:11:07'),
(157, 103, 'จตุภัทร์ ตั้งคารวคุณ', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:11:09'),
(158, 1, 'นิธิพัฒน์ พุฒทอง', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:12:31'),
(159, 1, 'นิธิพัฒน์ พุฒทอง', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:12:37'),
(160, 57, 'ปวีณา ปุลิเวคินทร์', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:12:53'),
(161, 57, 'ปวีณา ปุลิเวคินทร์', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:13:00'),
(162, 7, 'นิสา ชาญประเสริฐ', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:13:11'),
(163, 1, 'นิธิพัฒน์ พุฒทอง', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:13:19'),
(164, 57, 'ปวีณา ปุลิเวคินทร์', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:13:27'),
(165, 1, 'นิธิพัฒน์ พุฒทอง', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:14:13'),
(166, 57, 'ปวีณา ปุลิเวคินทร์', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:14:18'),
(167, 1, 'นิธิพัฒน์ พุฒทอง', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:14:36'),
(168, 57, 'ปวีณา ปุลิเวคินทร์', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:14:40'),
(169, 1, 'นิธิพัฒน์ พุฒทอง', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:14:55'),
(170, 103, 'จตุภัทร์ ตั้งคารวคุณ', 'เคลียร์คิวอัตโนมัติ (ไม่พบใน JERA)', 'system', 'System', '2025-09-21 10:14:59'),
(171, 57, 'ปวีณา ปุลิเวคินทร์', 'นักกายภาพจบงาน (ส่งชำระเงิน)', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:15:06'),
(172, 1, 'นิธิพัฒน์ พุฒทอง', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:15:19'),
(173, 57, 'ปวีณา ปุลิเวคินทร์', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 10:15:26'),
(174, 1, 'นิธิพัฒน์ พุฒทอง', 'เคาน์เตอร์รับชำระเงินเรียบร้อย', '97', 'นายทดสอบระบบ', '2025-09-21 10:15:28'),
(175, 134, 'สารัชต์ รัตนาภรณ์', 'นักกายภาพรับงานเข้าห้อง Room 3 และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:23:49'),
(176, 134, 'สารัชต์ รัตนาภรณ์', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:23:58'),
(177, 134, 'สารัชต์ รัตนาภรณ์', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:24:05'),
(178, 7, 'นิสา ชาญประเสริฐ', 'เคาน์เตอร์รับชำระเงินเรียบร้อย (Override)', '97', 'นายทดสอบระบบ', '2025-09-21 10:25:43'),
(179, 134, 'สารัชต์ รัตนาภรณ์', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:26:49'),
(180, 5, 'อลิสา ธีปริญญะกุล', 'เคลียร์คิวอัตโนมัติ (ไม่พบใน JERA)', 'system', 'System', '2025-09-21 10:27:28'),
(181, 134, 'สารัชต์ รัตนาภรณ์', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:27:29'),
(182, 134, 'สารัชต์ รัตนาภรณ์', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:27:43'),
(183, 134, 'สารัชต์ รัตนาภรณ์', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:27:52'),
(184, 134, 'สารัชต์ รัตนาภรณ์', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:27:55'),
(185, 134, 'สารัชต์ รัตนาภรณ์', 'เคาน์เตอร์รับชำระเงินเรียบร้อย (Override)', '97', 'นายทดสอบระบบ', '2025-09-21 10:27:59'),
(186, 1, 'นิธิพัฒน์ พุฒทอง', 'นักกายภาพรับงานเข้าห้อง Room 1A และกำหนดแพทย์: นายแพทย์ ทดสอบระบบ', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:32:43'),
(187, 2, 'นิสา ชาญประเสริฐ', 'นักกายภาพรับงานเข้าห้อง Room 2 และกำหนดแพทย์: พญ. พรรณปพร ศรีพันธุ์วงศ์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:33:27'),
(188, 2, 'นิสา ชาญประเสริฐ', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:34:10'),
(189, 1, 'นิธิพัฒน์ พุฒทอง', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:34:11'),
(190, 1, 'นิธิพัฒน์ พุฒทอง', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 10:34:29'),
(191, 2, 'นิสา ชาญประเสริฐ', 'แพทย์ส่งกลับไปให้นักกายภาพ (คนเดิม)', '72', 'พญ. พรรณปพร ศรีพันธุ์วงศ์', '2025-09-21 10:34:37'),
(192, 2, 'นิสา ชาญประเสริฐ', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:34:45'),
(193, 1, 'นิธิพัฒน์ พุฒทอง', 'นักกายภาพแจ้งแพทย์', '99', 'ทดสอบ นักกายภาพ', '2025-09-21 10:34:46'),
(194, 2, 'นิสา ชาญประเสริฐ', 'แพทย์ตรวจเสร็จสิ้น', '72', 'พญ. พรรณปพร ศรีพันธุ์วงศ์', '2025-09-21 10:35:08'),
(195, 2, 'นิสา ชาญประเสริฐ', 'เคลียร์คิวอัตโนมัติ (ไม่พบใน JERA)', 'system', 'System', '2025-09-21 10:36:47'),
(196, 1, 'นิธิพัฒน์ พุฒทอง', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 11:03:23'),
(197, 1, 'นิธิพัฒน์ พุฒทอง', 'แพทย์ตรวจเสร็จสิ้น', '98', 'นายแพทย์ ทดสอบระบบ', '2025-09-21 11:03:27'),
(198, 1, 'นิธิพัฒน์ พุฒทอง', 'เคาน์เตอร์รับชำระเงินเรียบร้อย (Override)', '97', 'นายทดสอบระบบ', '2025-09-21 11:03:38');

-- --------------------------------------------------------

--
-- Table structure for table `patient_queue`
--

CREATE TABLE `patient_queue` (
  `id` int(11) NOT NULL,
  `opd_uuid` varchar(36) NOT NULL,
  `patient_hn` varchar(50) NOT NULL,
  `patient_name` varchar(255) NOT NULL,
  `status` enum('waiting_counter','waiting_therapy','in_therapy','waiting_doctor','payment_pending','completed') NOT NULL DEFAULT 'waiting_counter',
  `assigned_therapist_id` varchar(100) DEFAULT NULL,
  `assigned_therapist_name` varchar(255) DEFAULT NULL,
  `assigned_doctor_id` varchar(100) DEFAULT NULL,
  `assigned_doctor_name` varchar(255) DEFAULT NULL,
  `assigned_room_id` varchar(36) DEFAULT NULL,
  `assigned_room_name` varchar(255) DEFAULT NULL,
  `notes` text DEFAULT NULL,
  `last_updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `patient_queue`
--

INSERT INTO `patient_queue` (`id`, `opd_uuid`, `patient_hn`, `patient_name`, `status`, `assigned_therapist_id`, `assigned_therapist_name`, `assigned_doctor_id`, `assigned_doctor_name`, `assigned_room_id`, `assigned_room_name`, `notes`, `last_updated_at`, `created_at`) VALUES
(1, '092f72ae-8501-5512-9e80-913f196074c7', '25533-3-009500', 'นิธิพัฒน์ พุฒทอง', 'completed', '99', 'ทดสอบ นักกายภาพ', '98', 'นายแพทย์ ทดสอบระบบ', 'room-uuid-01', 'Room 1A', NULL, '2025-09-21 11:03:38', '2025-09-21 10:28:22'),
(2, 'ed83503e-daf5-53bc-bb97-609429c59cea', '25533-3-009506', 'นิสา ชาญประเสริฐ', 'completed', '99', 'ทดสอบ นักกายภาพ', '72', 'พญ. พรรณปพร ศรีพันธุ์วงศ์', 'room-uuid-03', 'Room 2', NULL, '2025-09-21 10:36:47', '2025-09-21 10:28:22');

-- --------------------------------------------------------

--
-- Table structure for table `rooms`
--

CREATE TABLE `rooms` (
  `uuid` varchar(36) NOT NULL,
  `name` varchar(255) NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `rooms`
--

INSERT INTO `rooms` (`uuid`, `name`, `is_active`) VALUES
('room-uuid-01', 'Room 1A', 1),
('room-uuid-02', 'Room 1B', 1),
('room-uuid-03', 'Room 2', 1),
('room-uuid-04', 'Room 3', 1),
('room-uuid-05', 'Room 4', 1),
('room-uuid-06', 'Room 5', 1),
('room-uuid-07', 'Room 6A', 1),
('room-uuid-08', 'Room 6B', 1),
('room-uuid-09', 'Room 7A', 1),
('room-uuid-10', 'Room 7B', 1),
('room-uuid-11', 'Room 8', 1),
('room-uuid-12', 'Room 9', 1),
('room-uuid-13', 'Room 10', 1),
('room-uuid-14', 'Room 11', 1),
('room-uuid-15', 'Room 12', 1);

-- --------------------------------------------------------

--
-- Table structure for table `system_settings`
--

CREATE TABLE `system_settings` (
  `setting_key` varchar(50) NOT NULL,
  `setting_value` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `system_settings`
--

INSERT INTO `system_settings` (`setting_key`, `setting_value`) VALUES
('jera_last_sync_time', '1758462663');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `patient_logs`
--
ALTER TABLE `patient_logs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `patient_queue`
--
ALTER TABLE `patient_queue`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `opd_uuid` (`opd_uuid`);

--
-- Indexes for table `rooms`
--
ALTER TABLE `rooms`
  ADD PRIMARY KEY (`uuid`);

--
-- Indexes for table `system_settings`
--
ALTER TABLE `system_settings`
  ADD PRIMARY KEY (`setting_key`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `patient_logs`
--
ALTER TABLE `patient_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=199;

--
-- AUTO_INCREMENT for table `patient_queue`
--
ALTER TABLE `patient_queue`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1175;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
